Projects/First_Benchmark/output/logs/int_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 0.00 qps: 48535.48 (r/w/o: 0.00/2091.89/46443.59) lat (ms,95%): 0.00 err/s: 17.40 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1.60 qps: 47975.89 (r/w/o: 0.00/1998.99/45976.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 48038.03 (r/w/o: 0.00/2044.78/45993.24) lat (ms,95%): 0.00 err/s: 10.41 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1.60 qps: 48079.83 (r/w/o: 0.00/2003.53/46076.31) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 0.00 qps: 47127.22 (r/w/o: 0.00/2014.05/45113.17) lat (ms,95%): 0.00 err/s: 12.60 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1.60 qps: 48957.14 (r/w/o: 0.00/2040.01/46917.13) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 0.00 qps: 46054.59 (r/w/o: 0.00/1953.05/44101.54) lat (ms,95%): 0.00 err/s: 9.60 reconn/s: 0.00
[ 40s ] thds: 8 tps: 0.00 qps: 49668.54 (r/w/o: 0.00/2069.63/47598.90) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1.60 qps: 47610.70 (r/w/o: 0.00/2070.96/45539.74) lat (ms,95%): 0.00 err/s: 15.81 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1.60 qps: 49366.02 (r/w/o: 0.00/2056.92/47309.10) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 0.00 qps: 47228.33 (r/w/o: 0.00/2069.16/45159.18) lat (ms,95%): 0.00 err/s: 21.60 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1.60 qps: 49185.84 (r/w/o: 0.00/2049.23/47136.60) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 0.00 qps: 46759.61 (r/w/o: 0.00/1998.47/44761.14) lat (ms,95%): 0.00 err/s: 12.39 reconn/s: 0.00
[ 70s ] thds: 8 tps: 0.00 qps: 49289.53 (r/w/o: 0.00/2053.97/47235.55) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           142586
        other:                           3227127
        total:                           3369713
    transactions:                        56     (0.80 per sec.)
    queries:                             3369713 (48132.86 per sec.)
    ignored errors:                      499    (7.13 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          70.0084s
    total number of events:              56

Latency (ms):
         min:                                 9939.66
         avg:                                10000.98
         max:                                10062.25
         95th percentile:                        0.00
         sum:                               560054.90

Threads fairness:
    events (avg/stddev):           7.0000/0.00
    execution time (avg/stddev):   70.0069/0.00