Projects/First_Benchmark/output/logs/int_queries_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 178.40 qps: 178.40 (r/w/o: 178.40/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 180.49 qps: 180.49 (r/w/o: 180.49/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 180.80 qps: 180.80 (r/w/o: 180.80/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 180.11 qps: 180.11 (r/w/o: 180.11/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 180.36 qps: 180.36 (r/w/o: 180.36/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 180.55 qps: 180.55 (r/w/o: 180.55/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 180.43 qps: 180.43 (r/w/o: 180.43/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 180.54 qps: 180.54 (r/w/o: 180.54/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 180.72 qps: 180.72 (r/w/o: 180.72/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 180.92 qps: 180.92 (r/w/o: 180.92/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 180.43 qps: 180.43 (r/w/o: 180.43/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 180.34 qps: 180.34 (r/w/o: 180.34/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            10828
        write:                           0
        other:                           0
        total:                           10828
    transactions:                        10828  (180.40 per sec.)
    queries:                             10828  (180.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0217s
    total number of events:              10828

Latency (ms):
         min:                                   24.72
         avg:                                   44.34
         max:                                   82.72
         95th percentile:                        0.00
         sum:                               480065.37

Threads fairness:
    events (avg/stddev):           1353.5000/2.18
    execution time (avg/stddev):   60.0082/0.01