Projects/First_Benchmark/output/logs/int_queries_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Tables KUNDENMITID and BESTELLUNGMITID have been successfully created.
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 0.00 qps: 18256.04 (r/w/o: 0.00/4564.01/13692.03) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 0.80 qps: 20124.48 (r/w/o: 0.80/4625.17/15498.50) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 0.00 qps: 23656.41 (r/w/o: 0.00/4435.69/19220.72) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 0.80 qps: 21729.86 (r/w/o: 0.80/4066.50/17662.56) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 0.80 qps: 21021.44 (r/w/o: 0.80/3942.62/17078.02) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 0.00 qps: 21297.95 (r/w/o: 0.00/3993.52/17304.43) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 0.80 qps: 18803.80 (r/w/o: 0.80/3527.46/15275.54) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 0.80 qps: 19457.36 (r/w/o: 0.80/3648.05/15808.50) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 0.00 qps: 22551.90 (r/w/o: 0.00/4226.13/18325.77) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 0.80 qps: 19448.99 (r/w/o: 0.80/3651.19/15797.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 0.80 qps: 18356.83 (r/w/o: 0.80/3450.56/14905.47) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 0.00 qps: 22161.09 (r/w/o: 0.00/4147.15/18013.93) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            32
        write:                           249805
        other:                           1029435
        total:                           1279272
    transactions:                        32     (0.51 per sec.)
    queries:                             1279272 (20303.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          63.0078s
    total number of events:              32

Latency (ms):
         min:                                 7066.93
         avg:                                 7872.46
         max:                                 8565.40
         95th percentile:                        0.00
         sum:                               251918.58

Threads fairness:
    events (avg/stddev):           8.0000/0.00
    execution time (avg/stddev):   62.9796/0.03

sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Cleanup successfully done